In [1]:
import pandas as pd
import numpy as np

In [2]:
# Создадим объект Series
my_series = pd.Series([5,6,7,8,9,10])
print(my_series)
# по сути это пронумерованный список

# примечание: можно подавать на вход словарь

0     5
1     6
2     7
3     8
4     9
5    10
dtype: int64

In [12]:
# можно достать индексы и сами значения в массив
my_series.index 
joke = my_series.values
print(joke,joke.dtype)

[ 5  6  7  8  9 10] int64

In [14]:
# можно создать серию со своими индексами и обращаться по ним
my_series = pd.Series([5,6,7,8,9,10], index = ['a','s','d','f','g','o'])

In [22]:
# можно изменять значения в серии по некоторым индексам 
my_series[['a','o']] = 148 # обращаемся к массиву некоторых значений
my_series

a    148
s      6
d      7
f      8
g      9
o    148
dtype: int64

In [20]:
# отфильтруем
my_series[my_series>7]
# my_series>7 создает серию, у которой напротив индексов стоит правда или ложь

a    148
f      8
g      9
o    148
dtype: int64

In [ ]:
#Теперь посмотрим внимательно на объекты типа DataFrame

In [28]:
# датафрейм это набор из Series
df = pd.DataFrame({
    "фрукты": ["яблоко", "банан", "вишня"],
    "овощи": ["морковь", "огурец", "помидор"],
    "животные": ["кошка", "собака", "кролик"]
})
print(df.to_markdown(index=False)) # один из методов красивого вывода датафрейма. Обычно можно просто написать его имя.
# обращаясь к некоторым столбцам мы получаем серию

| фрукты   | овощи   | животные   |
|:---------|:--------|:-----------|
| яблоко   | морковь | кошка      |
| банан    | огурец  | собака     |
| вишня    | помидор | кролик     |

In [ ]:
# можно читать из csv Файла указывая в функции read разделители  sep = ','
dat = pd.read_csv('путь к файлу имя', sep = ',')

In [ ]:
# в пандасе можно читать данные по чанкам, обрабатывая их последовательно.
# это может быть необходимо при работе с очень большими данными
for gm_chunk in pd.read_csv('имя', chunkssize = количество за раз прочитанных строк):
    некоторая обработка

In [32]:
# доступ к данным осуществляется так 
df.loc[[1],['овощи','фрукты']] # пишем номер строки (или )некотррый литерал а затем отбор столбцов, если требуется

    овощи фрукты
1  огурец  банан

In [35]:
# отбор производится аналогично Series
df[df.фрукты == 'яблоко'][['животные','овощи']] 
# сначала указали условие отбора, потом столбцы которые надо выбрать. Если нужна строка целиком, то условие не пигешем

  животные    овощи
0    кошка  морковь

In [36]:
# вставим новые столбцы
df['цифры'] = [3,5,8]

In [38]:
df['простые числа'] = [2,3,5]

In [39]:
df['цифры ^ простые числа'] = df['цифры'] ** df['простые числа']

In [40]:
df

   фрукты    овощи животные  цифры  простые числа  цифры ^ простые числа
0  яблоко  морковь    кошка      3              2                      9
1   банан   огурец   собака      5              3                    125
2   вишня  помидор   кролик      8              5                  32768

In [43]:
# ВАЖНО. Если хотим убрать колонку в исходном датафрейме нужно добавить параметр inplace = True, но мои\жно и вручную переписать
sas = df.drop(['фрукты'], axis = 1) # обязательно указать ось (для колонки это 1)

In [44]:
df

   фрукты    овощи животные  цифры  простые числа  цифры ^ простые числа
0  яблоко  морковь    кошка      3              2                      9
1   банан   огурец   собака      5              3                    125
2   вишня  помидор   кролик      8              5                  32768

In [45]:
sas

     овощи животные  цифры  простые числа  цифры ^ простые числа
0  морковь    кошка      3              2                      9
1   огурец   собака      5              3                    125
2  помидор   кролик      8              5                  32768

In [ ]:
# колоночки можно переименовывать методом df.rename(columns={"первое": "Местоположение"}, inplace=True)

In [48]:
df.describe(include=['object']) # предоставляет некоторую минимальную информацию

        фрукты    овощи животные
count        3        3        3
unique       3        3        3
top     яблоко  морковь    кошка
freq         1        1        1

In [49]:
df.describe()

          цифры  простые числа  цифры ^ простые числа
count  3.000000       3.000000               3.000000
mean   5.333333       3.333333           10967.333333
std    2.516611       1.527525           18880.020242
min    3.000000       2.000000               9.000000
25%    4.000000       2.500000              67.000000
50%    5.000000       3.000000             125.000000
75%    6.500000       4.000000           16446.500000
max    8.000000       5.000000           32768.000000

In [51]:
df.фрукты.value_counts()[:5] # получим 5 самых популярных элементов

фрукты
яблоко    1
банан     1
вишня     1
Name: count, dtype: int64

In [53]:
df.info() # выдаст информацию о типе и количестве ненулевых элементов

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 6 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   фрукты                 3 non-null      object
 1   овощи                  3 non-null      object
 2   животные               3 non-null      object
 3   цифры                  3 non-null      int64
 4   простые числа          3 non-null      int64
 5   цифры ^ простые числа  3 non-null      int64
dtypes: int64(3), object(3)
memory usage: 276.0+ bytes

In [54]:
# можно посмотреть на количество уникальных не нулевых объектов
[(col,df[col].nunique()) for col in df.columns]

[('фрукты', 3),
 ('овощи', 3),
 ('животные', 3),
 ('цифры', 3),
 ('простые числа', 3),
 ('цифры ^ простые числа', 3)]

In [58]:
df.sort_values(by = ['фрукты','овощи'], ascending = [True, True]) # сортировка

   фрукты    овощи животные  цифры  простые числа  цифры ^ простые числа
1   банан   огурец   собака      5              3                    125
2   вишня  помидор   кролик      8              5                  32768
0  яблоко  морковь    кошка      3              2                      9

In [61]:
df.groupby(by = 'фрукты')['простые числа'].max() # группируем по наборам элементов
# типо как агрегатные функции, смотрим в каком столбце считаем и что
# много значений можно получить через .agg(/// тут то что хотим посчитать)

фрукты
банан     3
вишня     5
яблоко    2
Name: простые числа, dtype: int64

In [ ]:
# с помощью методов concat можно объединить таблицы pd.concat(df1, df2)
# объединение по столбцам произведем по axis = 1
# также есть функции аналогичные LEFT JOIN